tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"

brew "ansible" # IT automation
brew "giflib" # GIF support for ffmpeg
brew "libtiff" # TIFF support for ffmpeg
brew "little-cms2" # JPEG support for ffmpeg
brew "webp" # WebP support for ffmpeg
brew "bat" # cat with wings
brew "gettext" # internationalization
brew "pixman" # pixel manipulation library
brew "cairo" # 2D graphics library
brew "cmake" # build system
brew "curl" # download files
brew "cyrus-sasl" # Simple Authentication and Security Layer
brew "docker" # containerization
brew "pango" # text rendering
brew "ffmpeg" # video editing
brew "fzf" # fuzzy finder
brew "git"
brew "git-secrets" # prevent secrets from being committed
brew "gnupg" # encryption
brew "go" 
brew "golangci-lint" # linter
brew "goreleaser" # release automation
brew "hyperfine" # benchmarking
brew "jpeg" # JPEG support for ffmpeg
brew "lazydocker" # docker management
brew "librsvg" # SVG support for ffmpeg
brew "mas" # Mac App Store CLI
brew "mkcert" # create local SSL certificates
brew "nmap" # network scanning
brew "nvm" # Node Version Manager
brew "openjdk" # Java
brew "pipx" # Python package installer
brew "pkg-config" # manage compile and link flags
brew "python@3.11" 
brew "redis"
brew "stow" # symlink manager
brew "tree" # display directory structure
brew "wget" # download files
brew "zoxide" # cd with fuzzy matching
brew "zsh" # shell

cask "arc" # browser 
cask "betterdisplay" # control display settings, enable HiDPI
cask "bitwarden" # password manager
cask "caffeine" # prevent Mac from sleeping
cask "discord"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "iterm2" # Terminal
cask "lunar" # control brightness of external monitors
cask "obsidian" # note-taking app
cask "raycast" # productivity tool to replace Spotlight
cask "rectangle" # window manager
cask "shottr" # screenshot tool
cask "spotify"
cask "stats" # displays system stats in the menu bar
cask "telegram-desktop"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zoom"

# Fonts
cask "font-fira-code" # programming font
cask "font-meslo-for-powerlevel10k" 
