tap "codecrafters-io/tap"
tap "dotenvx/brew"
tap "emqx/mqttx"
tap "felixkratz/formulae"
tap "golangci/tap"
tap "goreleaser/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "mac-cleanup/mac-cleanup-py"
tap "mongodb/brew"
tap "neilberkman/clippy"
tap "nikitabobko/tap"
tap "sidkhuntia/rune"

# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Library and utilities for processing GIFs
brew "giflib"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Download with resuming and segmented downloading
brew "aria2"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Core application library for C
brew "glib"
# Low-level library for pixel manipulation
brew "pixman"
# Vector graphics library with cross-device output support
brew "cairo"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Simple Authentication and Security Layer
brew "cyrus-sasl"
# Pack, ship and run any application as a lightweight container
brew "docker"
# OpenType text shaping engine
brew "harfbuzz"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# GIF image/animation creator/editor
brew "gifsicle"
# Distributed revision control system
brew "git"
# Prevents you from committing sensitive information to a git repo
brew "git-secrets"
# Audit git repos for secrets
brew "gitleaks"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Cross-platform application and UI framework
brew "qt"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# Command-line benchmarking tool
brew "hyperfine"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Time series, events, and metrics database
brew "influxdb"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Mac App Store command-line interface
brew "mas"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# General-purpose lossless data-compression library
brew "zlib"
# Open source relational database management system
brew "mysql"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Utility for managing network connections
brew "netcat"
# Port scanning utility for large networks
brew "nmap"
# Classic snake game with textual interface
brew "nsnake"
# HTTP load generator, inspired by rakyll/hey with tui animation
brew "oha"
# Development kit for the Java programming language
brew "openjdk"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Python version management
brew "pyenv"
# Python bindings for v5 of Qt
brew "pyqt@5"
# Python interface to Tcl/Tk
brew "python-tk@3.13"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Terminal multiplexer with VT100/ANSI terminal emulation
brew "screen"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Plugin-driven server agent for collecting & reporting metrics
brew "telegraf"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Bundler for JavaScript and friends
brew "webpack"
# Internet file retriever
brew "wget"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# CodeCrafters CLI
brew "codecrafters-io/tap/codecrafters"
# Secure dotenv–from the creator of `dotenv`
brew "dotenvx/brew/dotenvx"
# Fast linters runner for Go.
brew "golangci/tap/golangci-lint"
# Unified clipboard tool for macOS - a superset of pbcopy
brew "neilberkman/clippy/clippy"
# Localias is a tool for developers to securely manage local aliases for development servers.
brew "peterldowns/tap/localias"
# Supabase CLI
brew "supabase/tap/supabase"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Chromium based browser
cask "arc"
# Display management tool
cask "betterdisplay"
# Desktop password and login vault
cask "bitwarden"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Utility that prevents the system from going to sleep
cask "caffeine"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Voice and text chat software
cask "discord"
# Web browser
cask "firefox"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-meslo-for-powerlevel10k"
cask "font-sf-pro"
# Utility to hide menu bar items
cask "hiddenbar"
# Free and open-source media player
cask "iina"
# Adaptive brightness for external displays
cask "lunar"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
  # All-in-one workspace
  cask "notion-mail"
  # API Client
  cask "bruno"
  # DIA Browser
  cask "thebrowsercompany-dia"
# Control your tools with a few keystrokes
cask "raycast"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
  # AI-powered code editor
  cask "cursor"
# Screenshot measurement and annotation tool
cask "shottr"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Desktop client for Telegram messenger
cask "telegram-desktop"
# Tool to invert scroll direction for physical scroll wheels
cask "unnaturalscrollwheels"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Voice to text app
cask "voiceink"
# Rust-based terminal
cask "warp"
# Native desktop client for WhatsApp
cask "whatsapp"
# Video communication and virtual meeting platform
cask "zoom"
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835
vscode "andenetalexander.vim-cheatsheet"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "golang.go"
vscode "jakob101.relativepath"
vscode "jdinhlife.gruvbox"
vscode "kevinrose.vsc-python-indent"
vscode "mechatroner.rainbow-csv"
vscode "mgmcdermott.vscode-language-babel"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "msyrus.go-doc"
vscode "prisma.prisma"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "redis.redis-for-vscode"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "simonsiefke.svg-preview"
vscode "thiscodeworks.savecode"
vscode "timonwong.shellcheck"
vscode "vintharas.learn-vim"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
vscode "yoavbls.pretty-ts-errors"
